#include "Maze.h"
#include<iostream>
using namespace std;
/*
1，输入迷宫的行列 5，5
2，输入迷宫的路径信息（1，不能走，0可以走）
3，显示搜索的结果：不存在有效路径
有路径，打印路径信息。

分析问题，找该问题有那些实体需要抽象--》类（变量 方法）
在根据实际问题，组织类与类之间的关系--》组合
开始写main函数，根据题目要求的流程写代码逻辑
*/

int main()
{
	int n=5;
	cin >> n;
	int** ar = new int*[n];
	for (int i= 0; i < n; i++)
	{
		ar[i] = new int[n];
		for (int j = 0; j < n; j++)
		{
			cin >> ar[i][j];
		}
	}
	maze _maze(n, ar);
	_maze.start(n);
	return 0;
}

int main()
{
	return 0;
}


/*
9
0 1 0 0 0 0 0 1 1
0 1 0 1 0 1 0 0 0
0 0 0 1 0 1 1 1 0
1 1 0 1 0 1 0 0 0
1 1 0 0 0 1 0 1 1
1 1 0 1 0 1 0 0 0
1 1 0 1 0 1 1 1 0
1 1 0 0 0 1 1 1 0
1 1 1 1 1 1 1 1 0

2 1 2 2 2 2 2 1 1
2 1 2 1 0 1 2 2 2
2 2 2 1 0 1 1 1 2
1 1 0 1 0 1 2 2 2
1 1 0 0 0 1 2 1 1
1 1 0 1 0 1 2 2 2
1 1 0 1 0 1 1 1 2
1 1 0 0 0 1 1 1 2
1 1 1  1 1 1 1 1 2



6
0 1 0 0 0 0
0 1 0 1 0 0
0 0 0 0 0 1 
0 1 0 0 1 0
1 0 1 0 0 0
1 1 1 1 1 0


2 1 2 2 2 2
2 1 2 1 2 2
2 2 2 2 2 1
0 1 2 2 1 0
1 0 1 2 2 2
1 1 1 1 1 2
*/